# This Python file uses the following encoding: utf-8

grade_first=[{'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21500785', '과목명': '소그룹채플', '과목학점': '0.5', '성적': 'P', '등급': 'P', '교수명': '정대경', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21501815', '과목명': 'Academic and Professional English 1', '과목학점': '2.0', '성적': '98', '등급': 'A+', '교수명': '복은임', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21503037', '과목명': '현대인과성서', '과목학점': '3.0', '성적': '98', '등 급': 'A+', '교수명': '고형상', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21506302', '과목명': '기업의이해', '과목학점': '2.0', '성적': 'P', '등급': 'P', '교수명': '장우철', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21506634', '과목명': '한반도평화와통일', '과목학점': '1.0', '성적': 'P', '등급': 'P', '교수명': '조은 희', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21506685', '과목명': '독서와토론', '과목학점': '2.0', '성적': '96', '등급': 'A0', '교수명': '이상명', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21507500', '과목명': 'PHL', '과목학점': '3.0', '성적': '98', '등급': 'A+', '교수명': '홍기숙, 이정념', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '1학기', '과목코드': '21507501', '과목명': '융합전공을위한수학', '과목학점': '3.0', '성적': '97', '등급': 'A+', '교수명': '김연욱', '비고': '\xa0'}]
grade_second=[{'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500361', '과목명': '빅데이터프로그래밍언어', '과목학점': '3.0', '성적': '\xa0', '등급': '\xa0', '교수명': '이연란', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500362', '과목명': '경계(국경)없는미래', '과목학점': '3.0', '성적': 'P', '등급': 'P', '교수명': '최성우, 강인성, 이지하, 김지 영, 신정섭, 백경민, 한우재, 정인관, 박웅기', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500363', '과목명': 'IT기반의유통물류경영', '과목학점': '3.0', '성적': '\xa0', '등급': '\xa0', '교수명': '최천규', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500364', '과목명': '프로그래밍및실습', '과목학점': '3.0', '성적': '\xa0', '등급': '\xa0', '교수명': '김익수', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500519', '과목명': '대학글쓰기', '과목학점': '2.0', '성적': '\xa0', '등급': '\xa0', '교수명': '이주영', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500747', '과목명': 'AI와데이터사회', '과목학점': '2.0', '성적': '\xa0', '등급': '\xa0', '교수명': '강의선', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21500785', '과목명': '소 그룹채플', '과목학점': '0.5', '성적': '\xa0', '등급': '\xa0', '교수명': '정대경', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21501816', '과목명': 'Academic and Professional English 2', '과목학점': '2.0', '성적': '\xa0', ' 등급': '\xa0', '교수명': '정성희', '비고': '\xa0'}, {'이수학년도': '2022', '이수학기': '2 학기', '과목코드': '21506373', '과목명': '공공가치와리더십', '과목학점': '2.0', '성적': '\xa0', '등급': '\xa0', '교수명': '이국배', '비고': '\xa0'}]
# subject_names = ['21507500', '21507501', '21500361',"21500364",'21500363']
subject_names = ['PHL', '융합전공을위한수학', '빅데이터프로그래밍언어',"IT기반의유통물류경영",'프로그래밍및실습']

grade_second.extend(grade_first)

# print(grade_second)
columns_names = ['phl','math','programming','business_management','big_data','com_score','soft_score']

grade_hi={key:0 for key in columns_names}
grade_infos = [grade for grade in grade_second if (grade['과목명'] in subject_names)]
grade_simple=dict()
for i in grade_infos:
    grade_simple[i["과목명"]]=i["성적"]

# print(grade_simple)


grade_keys=grade_simple.keys()


for key in grade_keys:
    if key=="PHL":
       grade_hi["phl"]=grade_simple["PHL"]
    if key=="융합전공을위한수학":
        grade_hi["math"]=grade_simple["융합전공을위한수학"]
    if key=="프로그래밍및실습":
        grade_hi["programming"]=grade_simple["프로그래밍및실습"]
    if key=="IT기반의유통물류경영":
        grade_hi["business_management"]=grade_simple["IT기반의유통물류경영"]
    if key=="빅데이터프로그래밍언어":
        grade_hi["big_data"]=grade_simple["빅데이터프로그래밍언어"]







# insert_data = {'student_id':20191305, 'phl':90, 'math':90, 'big_data':90, 'programming':90, 'business_management':90, 
# 'department':"컴", 'com_score':0, 'soft_score':0, 'update_date':now}
